Autodesk.Navisworks.Api.Plugins.CommandAttribute
Defines a new command in the GUI system

Autodesk.Navisworks.Api.Plugins.CommandAttribute.#ctor(System.String)
Constructor
name:
The name of the command

Autodesk.Navisworks.Api.Plugins.CommandAttribute.CallCanExecute
Determines the conditions in which CanExecuteCommand should be called.

Autodesk.Navisworks.Api.Plugins.CommandAttribute.CanToggle
Specifies if the command can toggle

Autodesk.Navisworks.Api.Plugins.CommandAttribute.DisplayName
The text to display for this command

Autodesk.Navisworks.Api.Plugins.CommandAttribute.ExtendedToolTip
The Extended Tooltip to display for this command

Autodesk.Navisworks.Api.Plugins.CommandAttribute.Icon
The 16x16 icon to display for this command

Autodesk.Navisworks.Api.Plugins.CommandAttribute.LargeIcon
The 32x32 icon to display for this command

Autodesk.Navisworks.Api.Plugins.CommandAttribute.LoadForCanExecute
Specifies if CanExecuteCommand should cause the Plugin to load

Autodesk.Navisworks.Api.Plugins.CommandAttribute.Name
The name of the command

Autodesk.Navisworks.Api.Plugins.CommandAttribute.Shortcut
Specifies the keyboard shortcut for the command.

Autodesk.Navisworks.Api.Plugins.CommandAttribute.ShortcutWindowTypes
The Ids of the windows for which the shortcut is valid.
Multiple Ids can be specified by separating with ";".
If Ids are specified the shortcut should be valid in all contexts.

Autodesk.Navisworks.Api.Plugins.CommandAttribute.ToolTip
The Tooltip to display for this command